WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
  _ramlog_fd = -1;
  _uart1_fd = -1;
  _cliMsgLength = 0;
  _ramlog_reader_kthread_pid = 0;

  // These semaphores are needed for sending trace to CLI
  sem_init(&_readNxtSem, 0, 0);
  sem_setprotocol(&_readNxtSem, SEM_PRIO_NONE);

  sem_init(&_sendCliSem, 0, 0);
  sem_setprotocol(&_sendCliSem, SEM_PRIO_NONE);

  // Create a circular buffer instance to manage messages read from ramlog
  _ramlog_cbuf = (host_com_cir_buffer_t *)malloc(sizeof(struct host_com_cir_buffer_s));
  if (_ramlog_cbuf == NULL)
  {
    hcom_nx_uart1_direct(LOG_ERR, "%s@%d-cir buf malloc\n", thisFile, __LINE__);
    return -1;
  }

  // Initialize the internal circular buffer and use '/0' (NULL) as the delimiter. As
  // every string will terminate in this way.
  ret = hcom_cirbuf_init(_ramlog_cbuf, HCOM_TRACE_LOCAL_SYSLOG_CIR_BUF_SIZE, 0x0a);
  if (ret == HCOM_CIR_BUF_INIT_FAILED)
  {
    hcom_nx_uart1_direct(LOG_ERR, "%s@%d-Cir buf init failed\n", thisFile, __LINE__);
    return -1;
  }

  // Message buffer containing full messages pulled from the ramlog
  _syslogMsgBuf = malloc(HCOM_PROTOCOL_REQUEST_MAX_PAYLOAD_LEN);
  if (_syslogMsgBuf == NULL)
  {
    hcom_nx_uart1_direct(LOG_ERR, "%s@%d-cir buf malloc\n", thisFile, __LINE__);
    return -1;
  }

  // Create a thread to read the ramlog
  ret = hcom_nx_trace_msg_make_thread();
  if (ret < 0)
  {
    hcom_nx_uart1_direct(LOG_ERR, "%s@%d-thread create, errno:%d\n",
              thisFile, __LINE__, errno);

    free(_syslogMsgBuf);
    _syslogMsgBuf = NULL;
    return -1;
  }

  return OK;
}

//=============================================================
// Create a kthread to use as a syslog message reader
int hcom_nx_trace_msg_make_thread()
{
  _ramlog_reader_kthread_pid = kthread_create(HCOM_THREAD_NAME_TRACE_RAMLOG,
                                   HCOM_THREAD_PRIORITY_TRACE_RAMLOG,
                                   HCOM_THREAD_STACKSIZE_TRACE_RAMLOG,
                                   (main_t) hcom_nx_trace_msg_kthread,
                                   (char *const *) NULL);
  if (_ramlog_reader_kthread_pid <= 0)
  {
      return -ENOEXEC;
  }

  return OK;
}

//=================================================================
// This thread reads all ramlog messages received via syslog from
// the ramlog buffer and routes them to the UART1 and CLI. This
// thread once started is not stopped until F7 reset.
void *hcom_nx_trace_msg_kthread(int argc, char *argv[])
{
  int ret;
  uint8_t *readBuf;
  struct sigaction act;

  _trace_kthread_running = true;
  _shutting_down = false;
  sem_post(&_startupSem);

  readBuf = malloc(HCOM_TRACE_RAMLOG_READ_BUF_SIZE);

#if HCOM_DIAG_OUTPUT_SYSLOG_PID_OF_NEW_THREADS > 0
  syslog(2, "New kthread [PID:%d],'%s'\n", getpid(), HCOM_THREAD_NAME_TRACE_RAMLOG);
#endif

  // Attach a signal handler to catch the kill command
  act.sa_sigaction = hcom_nx_trace_msg_sig_recv;
  act.sa_flags = SA_SIGINFO;
  sigemptyset(&act.sa_mask);

  ret = sigaction(SIGALRM, &act, NULL);
  if (ret < 0)
  {
    _trace_kthread_running = false;
    free(readBuf);
    return NULL;
  }

  //-------------------------------------------
  // Only leave this loop when shutting down
  while(!_shutting_down)
  {
    // Must have ramlog, it's the source of all trace info
    ret = hcom_nx_trace_msg_open_ramlog();
    if(_shutting_down) break;
    if(ret < 0)
    {
      hcom_nx_trace_msg_close_and_delay(false);
      continue;
    }

    // Open uart1 if it's requested
    if(_trace_log_to_uart1)
    {
      ret = hcom_nx_trace_msg_open_uart1_serial_port();
      if(_shutting_down) break;
      if(ret < 0)
      {
        hcom_nx_trace_msg_close_and_delay(false);
        continue;
      }
    }

    // Attempt to read from the ramlog buffer
    ret = hcom_nx_trace_msg_read_ramlog_loop(readBuf);
    if(_shutting_down) break;
    if(ret < 0)
    {
      hcom_nx_trace_msg_close_and_delay(true);
    }
  }
  //-------------------------------------------

  // Time for this thread to exit
  hcom_nx_trace_kthread_exit_cleanup();

  _trace_kthread_running = false;
  free(readBuf);

  return NULL;
}

//=================================================================
// Need a signal handler or the default Nuttx behavior kicks in
void hcom_nx_trace_msg_sig_recv(int signo, FAR siginfo_t *info, FAR void *context)
{
  return;
}

//==========================================================================
// Initiate the kthread exit.
void hcom_nx_trace_kthread_exit_initiate()
{
  // A pthread cannot kill a kthread so we must indirectly kill the thread
  // by setting _shutting_down true, closing connections and waiting
  _shutting_down = true;

  // Make sure the semaphores won't block the exiting of either thread
  sem_post(&_readNxtSem);
  sem_post(&_sendCliSem);

  // Signal the kthread so _shutting_down will be tested, forcing it to exit
  kill(_ramlog_reader_kthread_pid, SIGALRM);

  // Nuttx kthreads have no 'join' functionality. We stay in this loop
  // until the exiting kthread has cleaned up it's resources.
  while(_trace_kthread_running)
  {
    usleep(10 * 1000);
  }

  sem_destroy(&_readNxtSem);
  sem_destroy(&_sendCliSem);
}

//==========================================================================
// This function is called by the kthread just before it exits
// and is used to reclaim resources
void hcom_nx_trace_kthread_exit_cleanup()
{
  _trace_log_to_uart1 = false;
  _trace_log_to_host = false;

  close(_ramlog_fd);
  _ramlog_fd = -1;

  close(_uart1_fd);
  _uart1_fd = -1;

  if(_ramlog_cbuf != NULL)
  {
    hcom_cirbuf_release_memory(_ramlog_cbuf);
    free(_ramlog_cbuf);
    _ramlog_cbuf = NULL;
  }

  if(_syslogMsgBuf != NULL)
  {
    free(_syslogMsgBuf);
    _syslogMsgBuf = NULL;
  }
}

//=================================================================
void hcom_nx_trace_msg_close_and_delay(bool ramLogClose)
{
  if(ramLogClose)
  {
    close(_ramlog_fd);
    _ramlog_fd = -1;
  }

  if(_uart1_fd > -1)
  {
    close(_uart1_fd);
    _uart1_fd = -1;
  }

