WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
  // Wait and try again
  if(!_shutting_down)
    usleep(100 * 1000);   // Not a special value, just prevent hard infinite looping
}

//=================================================================
int hcom_nx_trace_msg_open_ramlog()
{
  if(_ramlog_fd > -1)
  {
    close(_ramlog_fd);
    _ramlog_fd = -1;
  }

  _ramlog_fd = open(HCOM_TRACE_RAMLOG_DEVICE_NAME, O_RDONLY);
  if(_shutting_down) return OK;
  if (_ramlog_fd < 0)
  {
    hcom_nx_uart1_direct(LOG_ERR, "%s@%d-open %s, errno:%d\n",
            thisFile, __LINE__, HCOM_TRACE_RAMLOG_DEVICE_NAME, errno);
    return -1;
  }

  return OK;
}

//=================================================================
int hcom_nx_trace_msg_open_uart1_serial_port()
{
  if(_uart1_fd > -1)
  {
    close(_uart1_fd);
    _uart1_fd = -1;
  }

  _uart1_fd = open(HCOM_TRACE_RAMLOG_SERIAL_NAME, O_WRONLY);
  if(_shutting_down) return OK;
  if (_uart1_fd < 0)
  {
    _uart1_fd = -1;
    return -1;
  }
  return OK;
}

//=================================================================
// This function reads the data put into the ramlog by Nuttx
// Returning on error will close the uart connection
int hcom_nx_trace_msg_read_ramlog_loop(uint8_t *readBuf)
{
  ssize_t readReturn;
  int ret;


  while(!_shutting_down)
  {
    // Read ramlog
    readReturn = read(_ramlog_fd, readBuf, HCOM_TRACE_RAMLOG_READ_BUF_SIZE);
    if(_shutting_down) break;
    if (readReturn < 0 )
    {
      // Error
      hcom_nx_uart1_direct(LOG_ERR, "%s@%d ramlog read readReturn:%d errno:%d\n",
              thisFile, __LINE__, readReturn, errno);
      return -errno;    // Close connection, wait and try again
    }
    else if (readReturn == 0)
    {
      // EOF
      hcom_nx_uart1_direct(LOG_WARNING, "%s@%d ramlog read EOF read returned:%d errno:%d\n",
              thisFile, __LINE__, readReturn, errno);
      return -errno;    // Close connection, wait and try again
    }
    else
    {
      // Successful ramlog message read. Put message into circular buffer
      // unless all logging has been turned off
      if(_trace_log_to_host || _trace_log_to_uart1)
      {
        ret = hcom_nx_trace_msg_save_recvd_data(readBuf, readReturn);
        if (ret < 0 )
        {
          hcom_nx_uart1_direct(LOG_WARNING, "%s@%d hcom_nx_trace_msg_save_recvd_data() returned:%d\n",
                    thisFile, __LINE__, ret);
          return ret;    // Close connection, wait and try again
        }
      }
    }
  }   // while (!_shutting_down)

  return OK;
}

//=======================================================================
// Add the data read from ramlog into a circular buffer. It can be added
// byte by byte or several bytes at once.
// We assume that the message "unit" (aka line) will be delimited with
// 0x0a (AKA 'line feed' or '\n')
int hcom_nx_trace_msg_save_recvd_data(uint8_t readBuf[], const ssize_t recvByteCnt)
{
  int addResult;
  int pullResult;

  if (recvByteCnt == 0)
    return OK;

  // This loop is used to add received data and read all available data to/from
  // the buffer until no more will fit
  while(!_shutting_down)
  {
    // Can return HCOM_CIR_BUF_ADD_SUCCESS, HCOM_CIR_BUF_ADD_WONT_FIT, HCOM_CIR_BUF_ADD_BAD_ARG,
    addResult = hcom_cirbuf_add_bytes(_ramlog_cbuf, readBuf, recvByteCnt);
    if(_shutting_down) break;
    if(addResult == HCOM_CIR_BUF_ADD_SUCCESS)
    {
      break;    // Leave loop and check for data ready to read
    }
    else if (addResult == HCOM_CIR_BUF_ADD_WONT_FIT)
    {
      // The buffer doesn't have room for these bytes. We need to pull messages
      // and retry to add this data Only returns -error, HCOM_CIR_BUF_GET_NONE_FOUND
      // or HCOM_CIR_BUF_GET_DEST_NO_ROOM
      pullResult = hcom_nx_trace_msg_pull_all_packets_from_buffer();
      if(_shutting_down) break;
      if (pullResult == HCOM_CIR_BUF_GET_FOUND_MSG)
      {
        // Pulled and processed some message so attempt to add again
        continue;
      }

      if (pullResult == HCOM_CIR_BUF_GET_NONE_FOUND)
      {
        // This makes no sense. Like a buffer full of garbage and no delimiter
        hcom_nx_uart1_direct(LOG_ERR, "%s@%d-pull packets from cir buf, none found\n",
                 thisFile, __LINE__);
        return HCOM_CIR_BUF_GET_NONE_FOUND;    // Reported so throw data away.
      }

      if (pullResult == HCOM_CIR_BUF_GET_DEST_NO_ROOM)
      {

        // The buffer we supplied is too small for the message found
        hcom_nx_uart1_direct(LOG_ERR, "%s@%d-pull packets from cir buf, no room\n",
                 thisFile, __LINE__);
        return pullResult;    // Reported so throw data away.
      }
    }
    else if (addResult == HCOM_CIR_BUF_ADD_BAD_ARG)
    {
      // A bad argument is never expected
      hcom_nx_uart1_direct(LOG_ERR, "%s@%d-Bad argument to cir buf\n", thisFile, __LINE__);
      return addResult; // Report, throw data away and keep going
    }
    else
    {
      // Undefined error????
      hcom_nx_uart1_direct(LOG_ERR, "%s@%d-Unknown cir buf add err:%d\n", thisFile, __LINE__, addResult);
      return addResult; // Report, throw data away and keep going
    }
  }   // while(!_shutting_down)

  // Check if there's more complete message(s) buffered
  pullResult = hcom_nx_trace_msg_pull_all_packets_from_buffer();
  return pullResult;
}

//====================================================================
// Pull and process all the complete packets from the circular buffer
// Returns -error or one of the circular buffer get return values
int hcom_nx_trace_msg_pull_all_packets_from_buffer()
{
  int ret;
  size_t packetLength;

  while(!_shutting_down)
  {
    // If buffer too small for the found message packetLength will contain
    // the needed buffer size.
    ret = hcom_cirbuf_get_next_packet(_ramlog_cbuf, _syslogMsgBuf,
            HCOM_PROTOCOL_REQUEST_MAX_PAYLOAD_LEN, &packetLength);
    if(_shutting_down) break;

    // Any messages available?
    if (ret == HCOM_CIR_BUF_GET_NONE_FOUND)
    {
      return ret; // Buffer empty, return to get more data
    }

    if(ret == HCOM_CIR_BUF_GET_DEST_NO_ROOM)
    {
      // This is never expected, the buffer is too small for the message.
      // Possibly corrupted data....
      hcom_nx_uart1_direct(LOG_ERR, "%s@%d-buffer too small. Needed %d\n",
                thisFile, __LINE__, packetLength);
      return ret; // _syslogMsgBuf too small, throw away data and keep going 
    }
    
