WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
    // Circular Buffer ret must have been HCOM_CIR_BUF_GET_FOUND_MSG
    _cliMsgLength = packetLength;

    // Route the isolated message
    ret = hcom_nx_trace_msg_route_trace_text();
    if(_shutting_down) break;
    if (ret == OK)
    {
      continue; // pull next packet, if there is one
    }
    else
    {
      hcom_nx_uart1_direct(LOG_ERR, "%s@%d-processing data:%d\n", thisFile, __LINE__, ret);
      return HCOM_CIR_BUF_GET_NONE_FOUND;   // Assume buffer empty
    }
  }   // while(!_shutting_down)
  
  return HCOM_CIR_BUF_GET_FOUND_MSG;
}

//=================================================================
// Ship the ramlog text message to uart and/or host CLI
// If this function cannot send it, the message is lost....
int hcom_nx_trace_msg_route_trace_text(void)
{
  int ret;

  if(_trace_log_to_uart1)
  {
    // Route to uart1
    ret = hcom_nx_trace_msg_send_msg_to_uart1((char *) _syslogMsgBuf, _cliMsgLength);
    if(ret < 0)
    {
      return ret;
    }
  }

  if(_trace_log_to_host)
  {
    // Route to CLI
    // Release CLI pthread to return the  message in the buffer it provided,
    // to the CLI
    sem_post(&_sendCliSem);

    // Wait for message to be sent before getting next message. Why? Because
    // the _syslogMsgBuf buffer is a shared resource.
    hcom_nx_trace_msg_wait_sem(&_readNxtSem);
  }

  return OK;
}

//==========================================================================
// This is called via udp and provides a pthread, and the buffer for the
// message to CLI. On every call it waits for the next syslog message.
// When a message is found it returns and calls the code to send
// the message to CLI.
size_t hcom_nx_trace_cli_message_transport(char *buff, size_t buffLen)
{
  static bool firstTime = true;
  size_t msgLength;

  // The first call must be ignored. Afterward we allow the reader to get the
  // to keep things in sync.
  if(firstTime)
  {
    firstTime = false;
  }
  else
  {
    // The caller of this function has returned, indicating that the message
    // has been sent to the CLI. Therefore, allow the ramlog reader thread
    // to get the next message
    sem_post(&_readNxtSem);
  }

  // Wait for the next messge to be provided for CLI
  hcom_nx_trace_msg_wait_sem(&_sendCliSem);
  if(_shutting_down)
    return 0;

  // Truncate the message if too long for caller's buffer
  if(_cliMsgLength > buffLen)
    msgLength = buffLen;
  else
    msgLength = _cliMsgLength;

  // Currently the 2 threads run in a ping-pong fashion, only one can run
  // at a time. With some effort, once the data has been copied to the userland
  // buffer, the ramlog reader could be allowed to read the next message.
  // But, at this time the effort doesn't seem to be worth the benefit.
  memcpy(buff, _syslogMsgBuf, msgLength);

  // Return to userland with the message
  return msgLength;
}

//==========================================================================
// There's really isn't a good way to handle errors with ramlog because errors
// cannot be written to syslog or we'll end up with an infinite loop. So,
// the best we can do is send them to UART1, and hope it's being watched.
//--------------------------------------------------------------------------
// Send a string directly to uart1. The priority value is not used but makes
// this function signature like syslog so that this can be used as a substitute
// for syslog.
// Note:This funcion can ONLY be called from a kthread.
// Note:Calling from a userland pthread will CRASH Nuttx.
void hcom_nx_uart1_direct(int priority, const char *fmt, ...)
{
#define HCOM_NX_UART1_DIRECT_BUF_LEN (256)
  va_list ap;
  int stringLen;

  char *completeStr;
  completeStr = malloc(HCOM_NX_UART1_DIRECT_BUF_LEN);

  // Create the complete message
  va_start(ap, fmt);

  // Returned value is the string length, including '\0'. But, if buffer is too
  // small the returned value is the needed buffer length excluding terminating
  // '\0'. However, sending direct to uart means a '\0' is not needed anyway.
  stringLen = vsnprintf(completeStr, HCOM_NX_UART1_DIRECT_BUF_LEN, fmt, ap);
  va_end(ap);

  // We need the actual length. So if trucated we'll use the buffer's length
  if(stringLen > HCOM_NX_UART1_DIRECT_BUF_LEN)
    stringLen = HCOM_NX_UART1_DIRECT_BUF_LEN;

  hcom_nx_trace_msg_send_msg_to_uart1(completeStr, stringLen);
  
  // Need a carrage return which we usually don't add
  hcom_nx_trace_msg_send_msg_to_uart1("\r", 1);
  free(completeStr);
}

//==========================================================================
// Forward the message to the uart1 for transmission
int hcom_nx_trace_msg_send_msg_to_uart1(const char *toUartBuf, size_t numbBytes)
{
  // If uart1 not opened do this now
  if(_uart1_fd < 0)
  {
    int ret = hcom_nx_trace_msg_open_uart1_serial_port();
    if(ret < 0)
    {
      return ret;
    }
  }

  // Because the mono/meadow runtime may reconfigure all the GPIOs used by the board
  // we need to reconfigure them after mono starts. The problem is we don't know when
  // this is is. Therefore, we execute this code for a predetermined amount of time,
  // starting when mono has started running.
  if(_txRxReCfgStopTime != 0)
  {
    // Reconfigure uart1 (takes about 32usec to do all 4 commands)
    stm32_unconfiggpio(GPIO_USART1_TX); // PB14
    stm32_configgpio(GPIO_USART1_TX);
    stm32_unconfiggpio(GPIO_USART1_RX); // PH13
    stm32_configgpio(GPIO_USART1_RX);
    
    // Run until stop time is exceeded then stop the process
    if(_txRxReCfgStopTime < hcom_nx_trace_get_time_ms())
    {
      _txRxReCfgStopTime = 0;      // Past so timeout no longer needed
    }
  }

  // Write string out the uart
  ssize_t nbytes = write(_uart1_fd, toUartBuf, numbBytes);
  if (nbytes < 0)
  {
    return nbytes;
  }

  return OK;
}

//===========================================================================
// Wait for the thread holding the semaphore to release it
void hcom_nx_trace_msg_wait_sem(sem_t *semaphore)
{
  int ret;  
  DEBUGASSERT(semaphore != NULL);
  do
  {
    ret = sem_wait(semaphore);    // Take the semaphore (perhaps waiting)
    // The only case that an error should occur here is if the wait was awakened by a signal
    DEBUGASSERT(ret == OK || ret == -EINTR);
  }
  while (ret == -EINTR);
}

