WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
#endif    // #if defined (CONFIG_RAMLOG_SYSLOG)

//======================================================================================
// The following functions are always built. They are used to process
// hcom commands received from CLI that control the tracing feature.
//======================================================================================
//
// Called from Meadow.CLI to enable tracing to host.
int hcom_nx_exec_trace_do_send_to_host(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;
  
  // Set the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              0, HCOM_BBREG_ROUTE_TRACE_MSG_TO_HOST_BIT);

  // If ramlog configured, need to init ramlog now. This insures
  // that Meadow.CLI is listening
#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_host)
  {
    sendMsgToHost = "No change. Trace logs already sent to CLI";
  }
  else
  {
    _trace_log_to_host = true;

    // Initialize as needed
    hcom_nx_trace_msg_lazy_initialization();

    if(_trace_log_to_uart1)
      sendMsgToHost = "Trace logs now sent to CLI and UART1";
    else
      sendMsgToHost = "Trace logs now sent to CLI";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, sendMsgToHost,
          thisFile, __LINE__);
  return OK;
}

//======================================================================================
// Called from Meadow.CLI for ramlog output to host
int hcom_nx_exec_trace_do_not_send_to_host(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;

  // Clear the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              HCOM_BBREG_ROUTE_TRACE_MSG_TO_HOST_BIT, 0);

#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_host)
  {
    // Disable ramlogs to host
    _trace_log_to_host = false;

    if(!_trace_log_to_uart1)
    {
      // Since no longer needed, terminate the main ramlog reader thread
      // and clean up it's resources
      hcom_nx_trace_kthread_exit_initiate();
      sendMsgToHost = "Trace logging will be terminated";
    }
    else
    {
      // When CLI sending stops we need to do a bit more cleanup.
      sem_post(&_sendCliSem);     // Allow userland pthread to return and exit
      sem_post(&_readNxtSem);     // Allow ramlog thread to leave
                                  // 'if(_trace_log_to_host)' block.

      sendMsgToHost = "Will no longer send trace logs to CLI";
    }
  }
  else
  {
    sendMsgToHost = "No change. Trace logs still not sent to CLI";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, sendMsgToHost,
          thisFile, __LINE__);

  return OK;
}

//======================================================================================
// Called from Meadow.CLI to enable tracing to uart1.
int hcom_nx_exec_trace_forward_to_uart1(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;
  
   // Set the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              0, HCOM_BBREG_ROUTE_TRACE_MSG_TO_UART1_BIT);

  // If ramlog configured, need to init ramlog now. This insures
  // that Meadow.CLI is listening
#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_uart1)
  {
    sendMsgToHost = "No change. Trace logs already sent to UART1";
  }
  else
  {
    _trace_log_to_uart1 = true;

    // Initialize if needed
    hcom_nx_trace_msg_lazy_initialization();

    if(_trace_log_to_host)
      sendMsgToHost = "Trace logs now sent to UART1 and CLI";
    else
      sendMsgToHost = "Trace logs now sent to UART1";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, sendMsgToHost,
          thisFile, __LINE__);

  return OK;
}

//======================================================================================
// Called from Meadow.CLI for ramlog output to uart1
int hcom_nx_exec_trace_do_not_send_to_uart1(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;

  // Clear the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              HCOM_BBREG_ROUTE_TRACE_MSG_TO_UART1_BIT, 0);

#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_uart1)
  {
    _trace_log_to_uart1 = false;

    if(!_trace_log_to_host)
    {
      // Since no longer needed, terminate the main ramlog reader thread
      // and clean up it's resources
      hcom_nx_trace_kthread_exit_initiate();

      sendMsgToHost = "Trace logging will be terminated";
    }
    else
    {
      sendMsgToHost = "Will no longer send trace logs to UART1";
    }
  }
  else
  {
    sendMsgToHost = "No change. Trace logs still not sent to UART1";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
            sendMsgToHost, thisFile, __LINE__);
  
  return OK;
}

//======================================================================================
// Called after meadow configuration has started
void hcom_nx_trace_insure_correct_config(bool uartTracing, bool cliTracing)
{
  bool needToInit = false;

  if(uartTracing && (!_trace_log_to_uart1))
  {
    _trace_log_to_uart1 = true;
    needToInit = true;
  }

  if(cliTracing && (!_trace_log_to_host))
  {
    _trace_log_to_host = true;
    needToInit = true;
  }

  if(needToInit)
    hcom_nx_trace_msg_lazy_initialization();
}
